In [1]:
import pandas as pd

korea_weather = pd.DataFrame({
    'city': ['seoul','anyang','sungnam'],
    'temp': [23,32,12],
    'humidity': [50,60,55]
})
korea_weather

      city  humidity  temp
0    seoul        50    23
1   anyang        60    32
2  sungnam        55    12

In [2]:
us_weather = pd.DataFrame({
    'city': ['texas','newyork','LA'],
    'temp': [13,15,19],
    'humidity': [56,62,51]
})
us_weather

      city  humidity  temp
0    texas        56    13
1  newyork        62    15
2       LA        51    19

In [3]:
df = pd.concat([korea_weather, us_weather],
               ignore_index=False, keys=['korea','us'])
df

            city  humidity  temp
korea 0    seoul        50    23
      1   anyang        60    32
      2  sungnam        55    12
us    0    texas        56    13
      1  newyork        62    15
      2       LA        51    19

In [4]:
df.loc['korea']

      city  humidity  temp
0    seoul        50    23
1   anyang        60    32
2  sungnam        55    12

In [21]:
temp_df = pd.DataFrame({
    'city': ['seoul','anyang','sungnam'],
    'temp': [23,32,12],
}, index=[0,1,2])

win_df = pd.DataFrame ({
    'city': ['anyang','seoul','sungnam'],
    'speed': [3,5,7],
}, index=[1,0,2])

In [22]:
type(temp_df)

pandas.core.frame.DataFrame

In [23]:
#temp_df
#win_df

In [24]:
df2 = pd.concat([temp_df, win_df],axis =1)
df2

      city  temp     city  speed
0    seoul    23    seoul      5
1   anyang    32   anyang      3
2  sungnam    12  sungnam      7

In [28]:
s =pd.Series(['humid','dry','rain'], name='event')
s

0    humid
1      dry
2     rain
Name: event, dtype: object

In [29]:
df = pd.concat([temp_df, s], axis=1)
df

      city  temp  event
0    seoul    23  humid
1   anyang    32    dry
2  sungnam    12   rain